       >> SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. TWOARRAY.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT OUTFILE ASSIGN TO "REGION.DAT".
DATA DIVISION.
FILE SECTION.
FD OUTFILE
LABEL RECORDS ARE STANDARD
DATA RECORD IS REGION-REC.
01 REGION-REC PIC X(80).
WORKING-STORAGE SECTION.
01 I PIC 9 VALUE ZERO.
01 J PIC 9 VALUE ZERO.
01 REGION-CODE.
       02 REGION-CODE OCCURS 5 TIMES PIC X(10).
01 SALES.
       02 SALESMAN-1 OCCURS 5 TIMES PIC 9(5)V99.
       02 SALESMAN-2 OCCURS 5 TIMES PIC 9(5)V99.
       02 SALESMAN-3 OCCURS 5 TIMES PIC 9(5)V99.
01 TOTAL.
       02 TOTAL-SALES OCCURS 5 TIMES PIC 9(6)V99.
01 HDG-0.
       02 FILLER PIC X(4) VALUE "REGION CODE".
       02 FILLER PIC X(10) VALUE SPACES.
       02 FILLER PIC X(4) VALUE "SALESMAN 1".
       02 FILLER PIC X(10) VALUE SPACES.
       02 FILLER PIC X(4) VALUE "SALESMAN 2".
       02 FILLER PIC X(10) VALUE SPACES.
       02 FILLER PIC X(4) VALUE "SALESMAN 3".
       02 FILLER PIC X(10) VALUE SPACES.
       02 FILLER PIC X(24) VALUE "TOTAL".
01 HDG-1.
       02 REGION-CODE-OUT PIC X(10).
       02 FILLER PIC X(4) VALUE SPACES.
       02 ITCS-OUT OCCURS 2 TIMES.
           03 ITCSOUT PIC ZZ.
           03 FILLER PIC X(12) VALUE SPACES.
       02 TOTAL-STUDENT-PER-YEAR-OUT PIC Z(4).
01 TOTAL-FTR.
       02 FILLER PIC X(5) VALUE "TOTAL".
       02 FILLER PIC X(8) VALUE SPACES.
       02 TOTAL-BSIT-STUDENT-OUT PIC Z(4). *> Prints the total of BSIT students
       02 FILLER PIC X(10) VALUE SPACES.
       02 TOTAL-BSCS-STUDENT-OUT PIC Z(4). *> Prints the total of BSCS students
01 COLLEGE-LEVEL-ARRAY.
       05 YEAR-ELEMENT OCCURS 4 TIMES PIC X(10). *> Store the value of year level e.g Freshmen, Sophomore, etc.
01 L PIC 9 VALUE ZERO.
01 KORS PIC X(4) VALUE SPACES.
01 TOTAL-BSIT-STUDENT PIC 9(4) VALUE 0.
01 TOTAL-BSCS-STUDENT PIC 9(4) VALUE 0.
01 TOTAL-STUDENT-ARRAY.
       05 TOTAL-STUDENT-PER-YEAR OCCURS 4 TIMES PIC 9(4). *> Stores the total student per year
SCREEN SECTION.
01 SCRN.
       02 BLANK SCREEN.
PROCEDURE DIVISION.

       *> Move values to year-element for printing
       MOVE "FRESHMEN"   TO YEAR-ELEMENT (1).
       MOVE "SOPHOMORE"  TO YEAR-ELEMENT (2).
       MOVE "JUNIOR"     TO YEAR-ELEMENT (3).
       MOVE "SENIOR"     TO YEAR-ELEMENT (4).

       OPEN OUTPUT OUTFILE.
           PERFORM HDG-RTN.
           PERFORM PROCESS-RTN.
           PERFORM FIN-RTN.
       HDG-RTN.
           WRITE COURSE-REC FROM HDG-0.
           WRITE COURSE-REC FROM HDG-1 AFTER 1 LINE.
           WRITE COURSE-REC FROM HDG-2 AFTER 2 LINES.
           MOVE SPACES TO COURSE-REC.
           WRITE COURSE-REC AFTER 1 LINE.
PROCESS-RTN.
       DISPLAY SCRN.
       DISPLAY "ENTER NUMBER OF STUDENTS FOR BSCS AND BSIT: "
       LINE 5 COLUMN 5.
       MOVE 6 TO L.
       PERFORM IN-RTN VARYING I FROM 1 BY 1 UNTIL I > 4
       AFTER J FROM 1 BY 1 UNTIL J > 2.

IN-RTN.
       DISPLAY "ENTER NUMBER OF STUDENTS FOR : " LINE L COLUMN 5.
       IF J = 1
           MOVE "BSIT" TO KORS.
       IF J = 2
           MOVE "BSCS" TO KORS.
       DISPLAY KORS LINE L COLUMN 34.
       DISPLAY "YEAR LEVEL " LINE L COLUMN 39.
       DISPLAY I LINE L COLUMN 50.
       DISPLAY " : " LINE L COLUMN 51.
       ACCEPT NO-STUD (I, J) LINE L COLUMN 55.

       *> Check if current element is BSIT or BSCS, if so it iwll add total student in all year level
       IF J = 1
           ADD NO-STUD (I, 1) TO TOTAL-BSIT-STUDENT.
       IF J = 2
           ADD NO-STUD (I, 2) TO TOTAL-BSCS-STUDENT.

       ADD NO-STUD (I, J) TO TOTAL-STUDENT-PER-YEAR (I). *> sum the total of BSIT and BSCS students per year
       MOVE TOTAL-STUDENT-PER-YEAR (I) TO TOTAL-STUDENT-PER-YEAR-OUT.
       MOVE NO-STUD (I, J) TO ITCSOUT (J).
       MOVE YEAR-ELEMENT (I) TO COLLEGE-LEVEL-OUT.
       IF J = 2
           PERFORM OUT-RTN.
       ADD 1 TO L.
OUT-RTN.
       MOVE TOTAL-BSIT-STUDENT TO TOTAL-BSIT-STUDENT-OUT.
       MOVE TOTAL-BSCS-STUDENT TO TOTAL-BSCS-STUDENT-OUT.
       WRITE COURSE-REC FROM HDG-3 AFTER 1 LINE.
       MOVE 0 TO TOTAL-STUDENT-PER-YEAR (I). *> resets the value to prevent stock up of values
       MOVE 5 TO L.
       MOVE 0 TO NO-STUD(I, J).

FIN-RTN.
       WRITE COURSE-REC FROM TOTAL-FTR AFTER 2 LINES. *> Write the totals of all students in all year level 1 time only
       CLOSE OUTFILE.
STOP RUN.
