IDENTIFICATION DIVISION.
PROGRAM-ID. SALES-REPORT.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT OUTFILE ASSIGN TO "REGION.DAT".

DATA DIVISION.
FILE SECTION.
FD OUTFILE
   LABEL RECORDS ARE STANDARD
   DATA RECORD IS REGION-REC.
01 REGION-REC PIC X(80).

WORKING-STORAGE SECTION.
01 REGION-CODES.
   02 REGION-CODE OCCURS 5 TIMES PIC 9 VALUE ZEROS.
01 SALES.
   02 SALESMAN OCCURS 5 TIMES.
      03 SALESMAN-1 PIC 9(5)V99 VALUE ZEROS.
      03 SALESMAN-2 PIC 9(5)V99 VALUE ZEROS.
      03 SALESMAN-3 PIC 9(5)V99 VALUE ZEROS.
01 TOTAL-SALES OCCURS 5 TIMES PIC 9(6)V99 VALUE ZEROS.
01 AVERAGE-SALES OCCURS 5 TIMES PIC 9(6)V99 VALUE ZEROS.
01 I PIC 9 VALUE ZEROS.
01 J PIC 9 VALUE ZEROS.
01 TEMP-TOTAL PIC 9(7)V99 VALUE ZEROS.
01 TEMP-AVERAGE PIC 9(6)V99 VALUE ZEROS.
01 LINE-COUNTER PIC 9(3) VALUE ZEROS.
01 HDG-1 PIC X(80) VALUE
   "REGION CODE     SALESMAN 1    SALESMAN 2    SALESMAN 3    TOTAL".
01 HDG-2 PIC X(80) VALUE
   "REGION CODE     AVERAGE SALES PER REGION".

PROCEDURE DIVISION.
MAIN-RTN.
   DISPLAY "ENTER SALES DATA FOR 5 REGIONS."
   PERFORM INPUT-RTN
   PERFORM CALCULATE-TOTALS-RTN
   PERFORM OUTPUT-RTN
   STOP RUN.

INPUT-RTN.
   PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
      DISPLAY "ENTER SALES FOR REGION " I ":"
      DISPLAY "  SALESMAN 1: "
      ACCEPT SALESMAN(I,1)
      DISPLAY "  SALESMAN 2: "
      ACCEPT SALESMAN(I,2)
      DISPLAY "  SALESMAN 3: "
      ACCEPT SALESMAN(I,3)
   END-PERFORM.

CALCULATE-TOTALS-RTN.
   PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
      COMPUTE TEMP-TOTAL = SALESMAN(I,1) + SALESMAN(I,2) + SALESMAN(I,3)
      MOVE TEMP-TOTAL TO TOTAL-SALES(I)
      COMPUTE TEMP-AVERAGE = TEMP-TOTAL / 3
      MOVE TEMP-AVERAGE TO AVERAGE-SALES(I)
   END-PERFORM.

OUTPUT-RTN.
   DISPLAY HDG-1
   PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
      DISPLAY REGION-CODE(I) "          "
              SALESMAN(I,1) "          "
              SALESMAN(I,2) "          "
              SALESMAN(I,3) "          "
              TOTAL-SALES(I)
   END-PERFORM.

   DISPLAY "\n" HDG-2
   PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
      DISPLAY REGION-CODE(I) "          " AVERAGE-SALES(I)
   END-PERFORM.

   WRITE REGION-REC FROM HDG-1.
   PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
      MOVE REGION-CODE(I) TO REGION-REC(1:10)
      MOVE SALESMAN(I,1) TO REGION-REC(15:10)
      MOVE SALESMAN(I,2) TO REGION-REC(25:10)
      MOVE SALESMAN(I,3) TO REGION-REC(35:10)
      MOVE TOTAL-SALES(I) TO REGION-REC(45:10)
      WRITE REGION-REC
   END-PERFORM.

   WRITE REGION-REC FROM HDG-2.
   PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
      MOVE REGION-CODE(I) TO REGION-REC(1:10)
      MOVE AVERAGE-SALES(I) TO REGION-REC(15:10)
      WRITE REGION-REC
   END-PERFORM.

   CLOSE OUTFILE.
